//=============================================================================
//
// 地面処理 [SKYBALL.h]
// Author : 
//
//=============================================================================
#pragma once
#include <d3dx9.h>
#include "renderer.h"


//*****************************************************************************
// マクロ定義
//*****************************************************************************
struct SKYBALL
{
	D3DXVECTOR3		pos;		// 位置
	D3DXVECTOR3		rot;		// 向き(回転)
	D3DXVECTOR3		scl;		// 大きさ(スケール)
	bool			use;		// 表示フラグ

	int				idxShadow;	// 影の識別子

	D3DXVECTOR3     size;		// 当たり判定用サイズ

	D3DXMATRIX		mtxWorld;	// ワールドマトリックス
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitSkyball(void);
void UninitSkyball(void);
void UpdateSkyball(void);
void DrawSkyball(void);

SKYBALL* GetSkyball(void);


